report/stage_6/profiling/review_compare/wrk2_async_ftp_get.txt
$ wrk2 -c 128 -t 8 -d 65s -R 20000 -L -s ./scripts/get.lua http://localhost:8080/ >> output/wrk2_async_ftp_get.txt


Running 1m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.081ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.086ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.066ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.082ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.072ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.070ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.082ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms  587.60us  14.58ms   71.10%
    Req/Sec     2.64k   212.36     4.44k    68.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.42ms
 90.000%    1.78ms
 99.000%    2.74ms
 99.900%    4.97ms
 99.990%    7.92ms
 99.999%   11.23ms
100.000%   14.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.040     0.000000            1         1.00
       0.390     0.100000       110350         1.11
       0.577     0.200000       220071         1.25
       0.738     0.300000       329982         1.43
       0.887     0.400000       439895         1.67
       1.032     0.500000       549548         2.00
       1.105     0.550000       604469         2.22
       1.178     0.600000       659371         2.50
       1.253     0.650000       714090         2.86
       1.333     0.700000       769400         3.33
       1.419     0.750000       824280         4.00
       1.466     0.775000       851358         4.44
       1.517     0.800000       878857         5.00
       1.572     0.825000       906176         5.71
       1.633     0.850000       933668         6.67
       1.703     0.875000       961450         8.00
       1.741     0.887500       975123         8.89
       1.782     0.900000       988808        10.00
       1.827     0.912500      1002496        11.43
       1.878     0.925000      1016148        13.33
       1.939     0.937500      1029879        16.00
       1.973     0.943750      1036669        17.78
       2.013     0.950000      1043543        20.00
       2.057     0.956250      1050363        22.86
       2.111     0.962500      1057296        26.67
       2.177     0.968750      1064123        32.00
       2.217     0.971875      1067538        35.56
       2.263     0.975000      1070981        40.00
       2.319     0.978125      1074477        45.71
       2.387     0.981250      1077849        53.33
       2.475     0.984375      1081287        64.00
       2.529     0.985938      1082947        71.11
       2.601     0.987500      1084700        80.00
       2.687     0.989062      1086405        91.43
       2.793     0.990625      1088117       106.67
       2.945     0.992188      1089818       128.00
       3.033     0.992969      1090673       142.22
       3.139     0.993750      1091530       160.00
       3.261     0.994531      1092397       182.86
       3.411     0.995313      1093243       213.33
       3.603     0.996094      1094100       256.00
       3.711     0.996484      1094534       284.44
       3.833     0.996875      1094960       320.00
       3.967     0.997266      1095388       365.71
       4.123     0.997656      1095819       426.67
       4.307     0.998047      1096249       512.00
       4.415     0.998242      1096461       568.89
       4.547     0.998437      1096676       640.00
       4.683     0.998633      1096895       731.43
       4.839     0.998828      1097104       853.33
       4.999     0.999023      1097319      1024.00
       5.099     0.999121      1097426      1137.78
       5.267     0.999219      1097534      1280.00
       5.431     0.999316      1097640      1462.86
       5.611     0.999414      1097750      1706.67
       5.803     0.999512      1097854      2048.00
       5.915     0.999561      1097909      2275.56
       6.031     0.999609      1097962      2560.00
       6.179     0.999658      1098015      2925.71
       6.339     0.999707      1098069      3413.33
       6.587     0.999756      1098122      4096.00
       6.723     0.999780      1098149      4551.11
       6.903     0.999805      1098176      5120.00
       7.047     0.999829      1098203      5851.43
       7.283     0.999854      1098230      6826.67
       7.495     0.999878      1098256      8192.00
       7.699     0.999890      1098270      9102.22
       7.947     0.999902      1098283     10240.00
       8.135     0.999915      1098297     11702.86
       8.351     0.999927      1098310     13653.33
       8.671     0.999939      1098323     16384.00
       8.807     0.999945      1098330     18204.44
       9.159     0.999951      1098337     20480.00
       9.295     0.999957      1098344     23405.71
       9.431     0.999963      1098350     27306.67
       9.759     0.999969      1098357     32768.00
       9.871     0.999973      1098360     36408.89
       9.975     0.999976      1098364     40960.00
      10.135     0.999979      1098367     46811.43
      10.335     0.999982      1098370     54613.33
      10.463     0.999985      1098374     65536.00
      10.511     0.999986      1098375     72817.78
      10.983     0.999988      1098378     81920.00
      11.231     0.999989      1098379     93622.86
      11.359     0.999991      1098380    109226.67
      12.431     0.999992      1098382    131072.00
      12.615     0.999993      1098383    145635.56
      12.695     0.999994      1098384    163840.00
      12.831     0.999995      1098385    187245.71
      12.831     0.999995      1098385    218453.33
      13.311     0.999996      1098386    262144.00
      13.527     0.999997      1098387    291271.11
      13.527     0.999997      1098387    327680.00
      13.935     0.999997      1098388    374491.43
      13.935     0.999998      1098388    436906.67
      13.935     0.999998      1098388    524288.00
      14.127     0.999998      1098389    582542.22
      14.127     0.999998      1098389    655360.00
      14.127     0.999999      1098389    748982.86
      14.127     0.999999      1098389    873813.33
      14.127     0.999999      1098389   1048576.00
      14.591     0.999999      1098390   1165084.44
      14.591     1.000000      1098390          inf
#[Mean    =        1.081, StdDeviation   =        0.588]
#[Max     =       14.584, Total count    =      1098390]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1299281 requests in 1.08m, 109.44MB read
  Non-2xx or 3xx responses: 917857
Requests/sec:  19989.07
Transfer/sec:      1.68MB